app/views/galleries/index.html.erb

SELECT COUNT(*) FROM "paintings" WHERE ("paintings".gallery_id = 1)
---
    <h2><%= link_to gallery.name, gallery %></h2>
    Paintings: <%= gallery.paintings.size %>